html/resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-09 三 00:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>简历</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Steiner" />
<link rel="stylesheet" type="text/css" href="http://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">简历</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9cc1a8e">个人信息</a></li>
<li><a href="#orgdcc9d14">个人能力</a>
<ul>
<li><a href="#org474d633">编辑器</a></li>
<li><a href="#orgdc346d3">操作系统</a></li>
<li><a href="#org63402df">云平台</a></li>
<li><a href="#orge3d6b63">编程语言</a>
<ul>
<li><a href="#org7c2a98d">接触过的有</a></li>
<li><a href="#org3dc2a98">以后打算把这几个作为主要编程语言</a></li>
</ul>
</li>
<li><a href="#org9bf7e01">编程工具</a>
<ul>
<li><a href="#orgc965a67">版本管理</a></li>
<li><a href="#orgb3a4369">调试</a></li>
</ul>
</li>
<li><a href="#org99ee843">论坛</a></li>
</ul>
</li>
<li><a href="#org37ab35f">既往经验</a>
<ul>
<li><a href="#orgf715c54">项目1 美女爬虫</a>
<ul>
<li><a href="#org352d9e1">项目地址</a></li>
<li><a href="#org6160cb2">介绍</a></li>
</ul>
</li>
<li><a href="#org57b480b">项目2 Web课程大作业 todolist</a>
<ul>
<li><a href="#org3dadb2a">项目地址</a></li>
<li><a href="#orgbc7ffda">介绍</a></li>
</ul>
</li>
<li><a href="#orga05fd7c">项目3 欧拉计划</a>
<ul>
<li><a href="#orgdd2d9dc">项目地址</a></li>
<li><a href="#org4282898">介绍</a></li>
</ul>
</li>
<li><a href="#org663d1d9">项目4 Julia MLJ 机器学习框架的笔记</a>
<ul>
<li><a href="#orgc032974">项目地址</a></li>
<li><a href="#org6d836bb">介绍</a></li>
</ul>
</li>
<li><a href="#org1bf830f">文档整理</a>
<ul>
<li><a href="#org2110727">Vue.js</a></li>
<li><a href="#orgd49555d">MLJ</a></li>
<li><a href="#org3a614ac">杂项</a></li>
</ul>
</li>
<li><a href="#org8feb997">未上传的</a>
<ul>
<li><a href="#orgfc56a91">Socket 套接字编程实战</a></li>
<li><a href="#org0f8513b">Flask + Vue 前后端分离项目</a></li>
<li><a href="#orgb05bd2a">scrapy 中间件的使用</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9cc1a8e" class="outline-2">
<h2 id="org9cc1a8e">个人信息</h2>
<div class="outline-text-2" id="text-org9cc1a8e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">学号</th>
<th scope="col" class="org-left">姓名</th>
<th scope="col" class="org-right">年纪</th>
<th scope="col" class="org-left">专业</th>
<th scope="col" class="org-left">意向职位</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">199050308</td>
<td class="org-left">陈吉昊</td>
<td class="org-right">20</td>
<td class="org-left">计算机</td>
<td class="org-left">Vue前端</td>
</tr>
</tbody>
</table>
</div>
</div>



<div id="outline-container-orgdcc9d14" class="outline-2">
<h2 id="orgdcc9d14">个人能力</h2>
<div class="outline-text-2" id="text-orgdcc9d14">
</div>
<div id="outline-container-org474d633" class="outline-3">
<h3 id="org474d633">编辑器</h3>
<div class="outline-text-3" id="text-org474d633">
<p>
Emacs，我用了两年了，配置自己慢慢调<br />
如果编辑的是 <b>Java</b> 或 <b>Android</b> 这种大项目的话，得用 <b>IDEA</b> 了<br />
另外我希望这个软件能从零开始，重新构建一遍，扩展能力虽然很强，但要自己调试个半天，<br />
<b>Emacs Lisp</b> 的运行效率也是一个难题，什么时候能把中文文档写好啊！！ 虽然有李杀写的文档<br />
但他为什么不写个中文版的，偏偏写英文，比了狗了<br />
<b>RMS</b> 什么时候能用 <b>Scheme</b> 重新写一遍呐 !!<br />
</p>
</div>
</div>
<div id="outline-container-orgdc346d3" class="outline-3">
<h3 id="orgdc346d3">操作系统</h3>
<div class="outline-text-3" id="text-orgdc346d3">
<p>
Ubuntu 挺熟悉的，我弄坏过好几次了<br />
千万别用 <b>aptitude</b> 这个软件安装，一个不小心 <b>apt</b> 就没了，整个桌面系统 <b>ubuntu-desktop</b> 也可能没掉<br />
到时候打开屏幕，你就会发现，他娘的不管你怎么输入密码，全都不给你通过<br />
于是你又重启电脑，发现开始界面是一个 <b>bash</b><br />
</p>

<p>
另外要装一些比较新的软件可能会碰到依赖地狱，想要装这个软件，但是他依赖的库与系统里的库版本不兼容，<br />
于是想尽办法装上去，这个系统被弄坏了<br />
还是从源代码编译吧，如果用静态依赖 <b>Build</b> 就更好了，不会与系统起冲突<br />
</p>
</div>
</div>

<div id="outline-container-org63402df" class="outline-3">
<h3 id="org63402df">云平台</h3>
<div class="outline-text-3" id="text-org63402df">
<p>
没钱买，又没有那个需求，买了也不知道干嘛<br />
只好逛逛天池平台，或者各个云平台的教课，你会发现对着 <b>PPT</b> 讲课有什么难的，还不如自己去实践<br />
</p>
</div>
</div>
<div id="outline-container-orge3d6b63" class="outline-3">
<h3 id="orge3d6b63">编程语言</h3>
<div class="outline-text-3" id="text-orge3d6b63">
</div>
<div id="outline-container-org7c2a98d" class="outline-4">
<h4 id="org7c2a98d">接触过的有</h4>
<div class="outline-text-4" id="text-org7c2a98d">
<ol class="org-ol">
<li>前端的<br />
<ul class="org-ul">
<li>Vue<br />
其实 <b>html</b> 的一些东西我都不会，我习惯从零构建一个组件，然后用标签贴上去<br /></li>
</ul></li>
<li>后端的<br />
<ul class="org-ul">
<li>Python<br /></li>
<li>C/C++<br /></li>
<li>Rust<br /></li>
<li>Clojure<br /></li>
</ul></li>
<li>关于数据分析的<br />
<ul class="org-ul">
<li>Julia<br /></li>
</ul></li>
<li>随便写写的<br />
<ul class="org-ul">
<li>Scheme<br /></li>
<li>Emacs Lisp<br /></li>
</ul></li>
<li>数据库<br />
<ul class="org-ul">
<li>MySQL<br /></li>
<li>MongoDB<br /></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org3dc2a98" class="outline-4">
<h4 id="org3dc2a98">以后打算把这几个作为主要编程语言</h4>
<div class="outline-text-4" id="text-org3dc2a98">
<ol class="org-ol">
<li>Python<br /></li>
<li>Vue with Typescript<br /></li>
</ol>

<p>
现在是工作需要，效率第一，其他的慢慢学吧<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org9bf7e01" class="outline-3">
<h3 id="org9bf7e01">编程工具</h3>
<div class="outline-text-3" id="text-org9bf7e01">
<p>
我没怎么用过这些编程工具，调试的需要，版本控制的需要很少<br />
好像大项目，或者跟别人合作才需要用到版本控制，一个小项目用 <b>Git</b> 也学不到什么东西<br />
</p>

<p>
调试是为了验证程序正确，比如在多线程调试，还有算法调试，还有不知道发生了什么的错误（说的就是C/C++）<br />
但是，如果你用了函数式的编程风格，并发安全的语言，静态语言，在编译的时候就把可能发生的错误纠正，也就不需要打那么多的断点了<br />
有这样两句话<br />
</p>
<ol class="org-ol">
<li>深夜了， <b>Golang</b> 程序员早已下班， <b>C/C++</b> 程序员还在打断点， <b>Rust</b> 程序员还在编译<br /></li>
<li>动态类型一时爽，代码重构火葬场<br /></li>
</ol>
</div>

<div id="outline-container-orgc965a67" class="outline-4">
<h4 id="orgc965a67">版本管理</h4>
<div class="outline-text-4" id="text-orgc965a67">
<p>
Git<br />
</p>
</div>
</div>
<div id="outline-container-orgb3a4369" class="outline-4">
<h4 id="orgb3a4369">调试</h4>
<div class="outline-text-4" id="text-orgb3a4369">
<p>
GDB, PDB<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org99ee843" class="outline-3">
<h3 id="org99ee843">论坛</h3>
<div class="outline-text-3" id="text-org99ee843">
<p>
这些都是跟别的编程爱好者交流的平台，跟他们交流过后才知道自己太弱了<br />
另外发现也不是一定要学英文，就算写得再怎么别扭，他们也还是能看懂<br />
还好没在编程论坛里发现 <b>政治正确</b><br />
</p>
<ol class="org-ol">
<li>Emacs China<br /></li>
<li>Julia China<br /></li>
<li>Slack<br /></li>
<li>Discord<br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org37ab35f" class="outline-2">
<h2 id="org37ab35f">既往经验</h2>
<div class="outline-text-2" id="text-org37ab35f">
</div>
<div id="outline-container-orgf715c54" class="outline-3">
<h3 id="orgf715c54">项目1 美女爬虫</h3>
<div class="outline-text-3" id="text-orgf715c54">
</div>
<div id="outline-container-org352d9e1" class="outline-4">
<h4 id="org352d9e1">项目地址</h4>
<div class="outline-text-4" id="text-org352d9e1">
<p>
<a href="https://gitee.com/nesteiner/cake">gitee</a><br />
</p>
</div>
</div>
<div id="outline-container-org6160cb2" class="outline-4">
<h4 id="org6160cb2">介绍</h4>
<div class="outline-text-4" id="text-org6160cb2">
<p>
这个项目其实已经不能用了，因为目标网站好像上不去了<br />
其实爬取美女图片的流程都差不多，最重要的是翻页爬取网页，在前一个网页爬取到后一个网页的地址，接着<br />
继续爬取<br />
次要的就是如何处理请求错误了，爬得太快容易被封，这个时候需要设置 <b>请求中间件</b> 或者设置间隔时间<br />
更高级的可以使用 <b>redis</b> 设置 <b>IP代理池</b> 和 <b>Cookie</b> 池，太累了，没有继续学下去<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org57b480b" class="outline-3">
<h3 id="org57b480b">项目2 Web课程大作业 todolist</h3>
<div class="outline-text-3" id="text-org57b480b">
</div>
<div id="outline-container-org3dadb2a" class="outline-4">
<h4 id="org3dadb2a">项目地址</h4>
<div class="outline-text-4" id="text-org3dadb2a">
<p>
<a href="https://gitee.com/nesteiner/todolist">gitee</a><br />
</p>
</div>
</div>
<div id="outline-container-orgbc7ffda" class="outline-4">
<h4 id="orgbc7ffda">介绍</h4>
<div class="outline-text-4" id="text-orgbc7ffda">
<p>
第一个学期的Web作业我用 <b>Vue</b> 做的，从10月份开始敲 <b>Vue</b> 代码，不断地实践，学得越来越快，<br />
顺带把以前 <b>html</b> 和 <b>css</b> 的一些难点弄懂了，本来还有一些文档没有整理，不过我也懒得去写<br />
下一步是学习 <b>scss</b> 和 <b>typescript with Vue</b> ，不过前几天发现 <a href="https://github.com/kaorun343/vue-property-decorator">vue-property-decorator</a> 这个库<br />
还不能正式支持 <b>Vue3</b> 版本，我只好先用 <b>tag</b> 为 <i>v10.0.0-rc.3</i> 的分支了<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orga05fd7c" class="outline-3">
<h3 id="orga05fd7c">项目3 欧拉计划</h3>
<div class="outline-text-3" id="text-orga05fd7c">
</div>
<div id="outline-container-orgdd2d9dc" class="outline-4">
<h4 id="orgdd2d9dc">项目地址</h4>
<div class="outline-text-4" id="text-orgdd2d9dc">
<p>
<a href="https://gitee.com/nesteiner/euler-project">gitee</a><br />
</p>
</div>
</div>
<div id="outline-container-org4282898" class="outline-4">
<h4 id="org4282898">介绍</h4>
<div class="outline-text-4" id="text-org4282898">
<p>
这个好像是去年写的，放了好久了<br />
那个时候想找个项目实践下我的编程能力， <b>LeetCode</b> 里全他妈算法题， <b>CodeWars</b> 那个时候不会科学上网，上去太慢，<br />
发现有欧拉计划的中文翻译网站，就开始实践了<br />
我好像用不同的语言写过这些题，有些题目没有校对过，题目有一些我拿去跟 <b>Julia</b> 论坛的人分享过<br />
<a href="https://discourse.juliacn.com/t/topic/3192">https://discourse.juliacn.com/t/topic/3192</a><br />
<a href="https://discourse.juliacn.com/t/topic/3226">https://discourse.juliacn.com/t/topic/3226</a><br />
<a href="https://discourse.juliacn.com/t/topic/3258">https://discourse.juliacn.com/t/topic/3258</a><br />
最后因为自己的数学能力实在不行，就停在 21 - 30 题了<br />
碰到不会的题目的时候，学会了去用 <b>Slack</b> 去跟别人讨论，丫的都是英文，还好喷到个新加坡的，会点中文<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org663d1d9" class="outline-3">
<h3 id="org663d1d9">项目4 Julia MLJ 机器学习框架的笔记</h3>
<div class="outline-text-3" id="text-org663d1d9">
</div>
<div id="outline-container-orgc032974" class="outline-4">
<h4 id="orgc032974">项目地址</h4>
<div class="outline-text-4" id="text-orgc032974">
<p>
<a href="https://github.com/noob-data-analaysis/data-analysis">github</a><br />
</p>
</div>
</div>
<div id="outline-container-org6d836bb" class="outline-4">
<h4 id="org6d836bb">介绍</h4>
<div class="outline-text-4" id="text-org6d836bb">
<p>
这个还是去年做的<br />
<a href="https://zhuanlan.zhihu.com/p/352732686">https://zhuanlan.zhihu.com/p/352732686</a><br />
这玩样查文档累死我了，全尼玛是英文，机翻看得也难懂<br />
<a href="https://alan-turing-institute.github.io/MLJ.jl/dev/">https://alan-turing-institute.github.io/MLJ.jl/dev/</a><br />
还好，花了三个月，单独啃完了一大部分内容，实践的时候顺带去 <b>Slack</b> 的 <b>#MLJ</b> 频道去问问作者，虽然<br />
我的问题都很弱智，没抽我就已经很好了<br />
</p>

<p>
顺带说一下，这个项目是跟极客时间的一个专栏同时学的<br />
<a href="https://time.geekbang.org/column/article/73248">https://time.geekbang.org/column/article/73248</a><br />
里面使用的语言是 <b>Python</b> ，看了看语法，我果断选择用 <b>Julia</b> 作实践，就是这个鳖孙第一次跑很慢，需要<br />
往内存里加载一堆东西，得用预编译或者多核CPU加速，目前还没有很好的 IDE 支持，除了 <b>Jupyter Notebook</b> ，好用是好用，<br />
就是不支持 <b>Emacs</b> 按键，还有就是 <b>ShowTables</b> 这个第三方库在里面用不了，好像是另一个第三方库 <b>WebIO</b> 的问题，在<br />
<b>notebook</b> 里渲染表格的时候经常失败<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org1bf830f" class="outline-3">
<h3 id="org1bf830f">文档整理</h3>
<div class="outline-text-3" id="text-org1bf830f">
</div>
<div id="outline-container-org2110727" class="outline-4">
<h4 id="org2110727">Vue.js</h4>
<div class="outline-text-4" id="text-org2110727">
<p>
<a href="https://segmentfault.com/u/nesteiner/articles">https://segmentfault.com/u/nesteiner/articles</a><br />
这是我放在 <b>SegmentFault</b> 的文章，这个网站的编辑器挺好用的，隔壁的知乎编辑器实在垃圾<br />
好久都没去写笔记了，主要是懒<br />
</p>
</div>
</div>
<div id="outline-container-orgd49555d" class="outline-4">
<h4 id="orgd49555d">MLJ</h4>
<div class="outline-text-4" id="text-orgd49555d">
<p>
<a href="https://zhuanlan.zhihu.com/p/352732686">https://zhuanlan.zhihu.com/p/352732686</a><br />
</p>
</div>
</div>
<div id="outline-container-org3a614ac" class="outline-4">
<h4 id="org3a614ac">杂项</h4>
<div class="outline-text-4" id="text-org3a614ac">
<p>
这两个是学爬虫的时候写的，关于 <b>Selenium</b> 测试框架的一些使用，不是很深奥<br />
<a href="https://zhuanlan.zhihu.com/p/272177213">https://zhuanlan.zhihu.com/p/272177213</a><br />
<a href="https://zhuanlan.zhihu.com/p/272036640">https://zhuanlan.zhihu.com/p/272036640</a><br />
</p>
</div>
</div>
</div>
<div id="outline-container-org8feb997" class="outline-3">
<h3 id="org8feb997">未上传的</h3>
<div class="outline-text-3" id="text-org8feb997">
</div>
<div id="outline-container-orgfc56a91" class="outline-4">
<h4 id="orgfc56a91">Socket 套接字编程实战</h4>
<div class="outline-text-4" id="text-orgfc56a91">
<p>
这个在我的 <b>Github</b> 主页里好像有，好像是以前的，一些太久没更新的仓库我都删掉了<br />
这个项目是参照极客时间的一个专栏实践的<br />
<a href="https://time.geekbang.org/column/article/111267">https://time.geekbang.org/column/article/111267</a><br />
我也忘了他在我哪个文件夹里了<br />
这个项目我记得学到了用 <b>Epoll</b> 作一个 <b>Reactor</b> 模型，然后我就忘了为什么取消执行这个项目<br />
</p>

<p>
哎呀卧槽，找到了，我传一下<br />
</p>
</div>
</div>
<div id="outline-container-org0f8513b" class="outline-4">
<h4 id="org0f8513b">Flask + Vue 前后端分离项目</h4>
<div class="outline-text-4" id="text-org0f8513b">
<p>
这个是为了 <b>JSP</b> 的大作业创建的，今天问了下老师，前端可以不写 <b>JSP</b> 代码，后端接口用 <b>Servlet</b> 就行了<br />
卧槽 ！！<br />
这个项目是参照 <b>Flask</b> 的一个入门教程修改的<br />
<a href="https://github.com/greyli/watchlist">https://github.com/greyli/watchlist</a><br />
这个项目的前端用的是 <b>Jinjia</b> 模板语法，后端用的是 <b>Flask</b><br />
我把它改成前端用 <b>Vue</b> ，后端用 <b>Flask</b> ，后端的功能只有对数据库的增删改查，还有处理 <b>COR</b> 这个跨域访问的错误<br />
还好，我还写了一个 <b>Servlet</b> 后端，这个学期的大作业就算是做好了吧，就差写文档了<br />
</p>
</div>
</div>
<div id="outline-container-orgb05bd2a" class="outline-4">
<h4 id="orgb05bd2a">scrapy 中间件的使用</h4>
<div class="outline-text-4" id="text-orgb05bd2a">
<p>
这些笔记没有写完是因为爬虫项目还没有完善，也有可能是太忙了，忘掉了<br />
有些内容还没有进行检验，不好发布，这是检验用的 <b>PlayGround</b><br />
<a href="http://exercise.kingname.info/">http://exercise.kingname.info/</a><br />
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Steiner</p>
<p class="date">Created: 2021-06-09 三 00:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>